<template>
  <div>
    <div class="up">
      <span @click="$router.back()">&lt;</span>
      <span>筑梦云课堂服务协议</span>
    </div>
    <div class="begin1">筑梦云课堂服务协议</div>
    <div class="begin2">欢迎您使用筑梦云课堂服务(以下简称"本服务")</div>
    <div class="paragraph">
      <p>(1)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。</p>
      <p>(2)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。</p>
      <p>(3)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。服务或相关中立的技术支持服务</p>
      <p>(4)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。服务或相关中立的技术支持服务</p>
      <p>(5)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。</p>
      <p>(6)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。</p>
      <p>(7)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。</p>
      <p>(4)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。服务或相关中立的技术支持服务</p>
      <p>(5)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。</p>
      <p>(6)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。</p>
      <p>(7)筑梦云课堂是一个中立的平台服务提供者，仅向课程发布者提供信息存储空间、链接等中立的网络服务或相关中立的技术支持服务，以供课程发布者在中立的平台上自主发布、运营、推广其课程等。</p>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {};
  }
};
</script>

<style scoped>
div .up {
  width: 100%;
  height: 1.207729rem;
  background-color: #ccc;
  position: fixed;
  top: 0;
  left: 0;
}
div .up span:nth-of-type(1) {
  position: absolute;
  left: 0.483092rem;
  top: 0;
  font-size: 0.57971rem;
  height: 1.207729rem;
  line-height: 1.207729rem;
}
div .up span:nth-of-type(2) {
  position: absolute;
  left: 1.207729rem;
  top: 0;
  font-size: 0.531401rem;
  height: 1.207729rem;
  line-height: 1.207729rem;
}
div .begin1{
  width: 100%;
  font-size: 0.434783rem;
  margin-top: 0.724638rem;
  line-height: 0.434783rem;
  text-align: center;
  font-weight: bold;
}
div .begin2{
  width: 100%;
  font-size: 0.434783rem;
  margin-top: 0.724638rem;
  line-height: 0.434783rem;
  text-align: center;
  padding: 0 1.207729rem 0 1.207729rem;
}
div .paragraph{
  text-indent: 2em;
  line-height: 0.434783rem;
  font-size: 0.434783rem;
  padding: 0 .966184rem 0 .966184rem;
  overflow: auto;
  margin-top: .483092rem;
}
</style>
